MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J10/mcu.h
extern volatile ECCP2DELbits_t ECCP2DELbits __at(0xF67);
// bitfield macros
#define _ECCP2DEL_PDC_POSN                                  0x0
#define _ECCP2DEL_PDC_POSITION                              0x0
#define _ECCP2DEL_PDC_SIZE                                  0x7
#define _ECCP2DEL_PDC_LENGTH                                0x7
#define _ECCP2DEL_PDC_MASK                                  0x7F
#define _ECCP2DEL_PRSEN_POSN                                0x7
#define _ECCP2DEL_PRSEN_POSITION                            0x7
#define _ECCP2DEL_PRSEN_SIZE                                0x1
#define _ECCP2DEL_PRSEN_LENGTH                              0x1
#define _ECCP2DEL_PRSEN_MASK                                0x80
#define _ECCP2DEL_PDC0_POSN                                 0x0
#define _ECCP2DEL_PDC0_POSITION                             0x0
#define _ECCP2DEL_PDC0_SIZE                                 0x1
#define _ECCP2DEL_PDC0_LENGTH                               0x1
#define _ECCP2DEL_PDC0_MASK                                 0x1
#define _ECCP2DEL_PDC1_POSN                                 0x1
#define _ECCP2DEL_PDC1_POSITION                             0x1
#define _ECCP2DEL_PDC1_SIZE                                 0x1
#define _ECCP2DEL_PDC1_LENGTH                               0x1
#define _ECCP2DEL_PDC1_MASK                                 0x2
#define _ECCP2DEL_PDC2_POSN                                 0x2
#define _ECCP2DEL_PDC2_POSITION                             0x2
#define _ECCP2DEL_PDC2_SIZE                                 0x1
#define _ECCP2DEL_PDC2_LENGTH                               0x1
#define _ECCP2DEL_PDC2_MASK                                 0x4
#define _ECCP2DEL_PDC3_POSN                                 0x3
#define _ECCP2DEL_PDC3_POSITION                             0x3
#define _ECCP2DEL_PDC3_SIZE                                 0x1
#define _ECCP2DEL_PDC3_LENGTH                               0x1
#define _ECCP2DEL_PDC3_MASK                                 0x8
#define _ECCP2DEL_PDC4_POSN                                 0x4
#define _ECCP2DEL_PDC4_POSITION                             0x4
#define _ECCP2DEL_PDC4_SIZE                                 0x1
#define _ECCP2DEL_PDC4_LENGTH                               0x1
#define _ECCP2DEL_PDC4_MASK                                 0x10
#define _ECCP2DEL_PDC5_POSN                                 0x5
#define _ECCP2DEL_PDC5_POSITION                             0x5
#define _ECCP2DEL_PDC5_SIZE                                 0x1
#define _ECCP2DEL_PDC5_LENGTH                               0x1
#define _ECCP2DEL_PDC5_MASK                                 0x20
#define _ECCP2DEL_PDC6_POSN                                 0x6
#define _ECCP2DEL_PDC6_POSITION                             0x6
#define _ECCP2DEL_PDC6_SIZE                                 0x1
#define _ECCP2DEL_PDC6_LENGTH                               0x1
#define _ECCP2DEL_PDC6_MASK                                 0x40
#define _ECCP2DEL_P2DC0_POSN                                0x0
#define _ECCP2DEL_P2DC0_POSITION                            0x0
#define _ECCP2DEL_P2DC0_SIZE                                0x1
#define _ECCP2DEL_P2DC0_LENGTH                              0x1
#define _ECCP2DEL_P2DC0_MASK                                0x1
#define _ECCP2DEL_P2DC1_POSN                                0x1
#define _ECCP2DEL_P2DC1_POSITION                            0x1
#define _ECCP2DEL_P2DC1_SIZE                                0x1
#define _ECCP2DEL_P2DC1_LENGTH                              0x1
#define _ECCP2DEL_P2DC1_MASK                                0x2
#define _ECCP2DEL_P2DC2_POSN                                0x2
#define _ECCP2DEL_P2DC2_POSITION                            0x2
#define _ECCP2DEL_P2DC2_SIZE                                0x1
#define _ECCP2DEL_P2DC2_LENGTH                              0x1
#define _ECCP2DEL_P2DC2_MASK                                0x4
#define _ECCP2DEL_P2DC3_POSN                                0x3
#define _ECCP2DEL_P2DC3_POSITION                            0x3
#define _ECCP2DEL_P2DC3_SIZE                                0x1
#define _ECCP2DEL_P2DC3_LENGTH                              0x1
#define _ECCP2DEL_P2DC3_MASK                                0x8
#define _ECCP2DEL_P2DC4_POSN                                0x4
#define _ECCP2DEL_P2DC4_POSITION                            0x4
#define _ECCP2DEL_P2DC4_SIZE                                0x1
#define _ECCP2DEL_P2DC4_LENGTH                              0x1
#define _ECCP2DEL_P2DC4_MASK                                0x10
#define _ECCP2DEL_P2DC5_POSN                                0x5
#define _ECCP2DEL_P2DC5_POSITION                            0x5
#define _ECCP2DEL_P2DC5_SIZE                                0x1
#define _ECCP2DEL_P2DC5_LENGTH                              0x1
#define _ECCP2DEL_P2DC5_MASK                                0x20
#define _ECCP2DEL_P2DC6_POSN                                0x6
#define _ECCP2DEL_P2DC6_POSITION                            0x6
#define _ECCP2DEL_P2DC6_SIZE                                0x1
#define _ECCP2DEL_P2DC6_LENGTH                              0x1
#define _ECCP2DEL_P2DC6_MASK                                0x40
#define _ECCP2DEL_P2RSEN_POSN                               0x7
#define _ECCP2DEL_P2RSEN_POSITION                           0x7
#define _ECCP2DEL_P2RSEN_SIZE                               0x1
#define _ECCP2DEL_P2RSEN_LENGTH                             0x1
#define _ECCP2DEL_P2RSEN_MASK                               0x80

// Register: ECCP2AS
#define ECCP2AS ECCP2AS
extern volatile unsigned char           ECCP2AS             __at(0xF68);
#ifndef _LIB_BUILD
asm("ECCP2AS equ 0F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSSBD                  :2;
        unsigned PSSAC                  :2;
        unsigned ECCPAS                 :3;
        unsigned ECCPASE                :1;
    };
    struct {
        unsigned PSSBD0                 :1;
        unsigned PSSBD1                 :1;
        unsigned PSSAC0                 :1;
        unsigned PSSAC1                 :1;
        unsigned ECCPAS0                :1;
        unsigned ECCPAS1                :1;
        unsigned ECCPAS2                :1;
    };
    struct {
        unsigned PSS2BD0                :1;
        unsigned PSS2BD1                :1;
        unsigned PSS2AC0                :1;
        unsigned PSS2AC1                :1;
        unsigned ECCP2AS0               :1;
        unsigned ECCP2AS1               :1;
        unsigned ECCP2AS2               :1;
        unsigned ECCP2ASE               :1;
    };
} ECCP2ASbits_t;
extern volatile ECCP2ASbits_t ECCP2ASbits __at(0xF68);
// bitfield macros
#define _ECCP2AS_PSSBD_POSN                                 0x0
#define _ECCP2AS_PSSBD_POSITION                             0x0
#define _ECCP2AS_PSSBD_SIZE                                 0x2
#define _ECCP2AS_PSSBD_LENGTH                               0x2
#define _ECCP2AS_PSSBD_MASK                                 0x3
#define _ECCP2AS_PSSAC_POSN                                 0x2
#define _ECCP2AS_PSSAC_POSITION                             0x2
#define _ECCP2AS_PSSAC_SIZE                                 0x2
#define _ECCP2AS_PSSAC_LENGTH                               0x2
#define _ECCP2AS_PSSAC_MASK                                 0xC
#define _ECCP2AS_ECCPAS_POSN                                0x4
#define _ECCP2AS_ECCPAS_POSITION                            0x4
#define _ECCP2AS_ECCPAS_SIZE                                0x3
#define _ECCP2AS_ECCPAS_LENGTH                              0x3
#define _ECCP2AS_ECCPAS_MASK                                0x70
#define _ECCP2AS_ECCPASE_POSN                               0x7
#define _ECCP2AS_ECCPASE_POSITION                           0x7
#define _ECCP2AS_ECCPASE_SIZE                               0x1
#define _ECCP2AS_ECCPASE_LENGTH                             0x1
#define _ECCP2AS_ECCPASE_MASK                               0x80
#define _ECCP2AS_PSSBD0_POSN                                0x0
#define _ECCP2AS_PSSBD0_POSITION                            0x0
#define _ECCP2AS_PSSBD0_SIZE                                0x1
#define _ECCP2AS_PSSBD0_LENGTH                              0x1
#define _ECCP2AS_PSSBD0_MASK                                0x1
#define _ECCP2AS_PSSBD1_POSN                                0x1
#define _ECCP2AS_PSSBD1_POSITION                            0x1
#define _ECCP2AS_PSSBD1_SIZE                                0x1
#define _ECCP2AS_PSSBD1_LENGTH                              0x1
#define _ECCP2AS_PSSBD1_MASK                                0x2
#define _ECCP2AS_PSSAC0_POSN                                0x2
#define _ECCP2AS_PSSAC0_POSITION                            0x2
#define _ECCP2AS_PSSAC0_SIZE                                0x1
#define _ECCP2AS_PSSAC0_LENGTH                              0x1
#define _ECCP2AS_PSSAC0_MASK                                0x4
#define _ECCP2AS_PSSAC1_POSN                                0x3
#define _ECCP2AS_PSSAC1_POSITION                            0x3
#define _ECCP2AS_PSSAC1_SIZE                                0x1
#define _ECCP2AS_PSSAC1_LENGTH                              0x1
#define _ECCP2AS_PSSAC1_MASK                                0x8
#define _ECCP2AS_ECCPAS0_POSN                               0x4
#define _ECCP2AS_ECCPAS0_POSITION                           0x4
#define _ECCP2AS_ECCPAS0_SIZE                               0x1
#define _ECCP2AS_ECCPAS0_LENGTH                             0x1
#define _ECCP2AS_ECCPAS0_MASK                               0x10
#define _ECCP2AS_ECCPAS1_POSN                               0x5
#define _ECCP2AS_ECCPAS1_POSITION                           0x5
#define _ECCP2AS_ECCPAS1_SIZE                               0x1
#define _ECCP2AS_ECCPAS1_LENGTH                             0x1
#define _ECCP2AS_ECCPAS1_MASK                               0x20
#define _ECCP2AS_ECCPAS2_POSN                               0x6
#define _ECCP2AS_ECCPAS2_POSITION                           0x6
#define _ECCP2AS_ECCPAS2_SIZE                               0x1
#define _ECCP2AS_ECCPAS2_LENGTH                             0x1
#define _ECCP2AS_ECCPAS2_MASK                               0x40
#define _ECCP2AS_PSS2BD0_POSN                               0x0
#define _ECCP2AS_PSS2BD0_POSITION                           0x0
#define _ECCP2AS_PSS2BD0_SIZE                               0x1
#define _ECCP2AS_PSS2BD0_LENGTH                             0x1
#define _ECCP2AS_PSS2BD0_MASK                               0x1
#define _ECCP2AS_PSS2BD1_POSN                               0x1
#define _ECCP2AS_PSS2BD1_POSITION                           0x1
#define _ECCP2AS_PSS2BD1_SIZE                               0x1
#define _ECCP2AS_PSS2BD1_LENGTH                             0x1
#define _ECCP2AS_PSS2BD1_MASK                               0x2
#define _ECCP2AS_PSS2AC0_POSN                               0x2
#define _ECCP2AS_PSS2AC0_POSITION                           0x2
#define _ECCP2AS_PSS2AC0_SIZE                               0x1
#define _ECCP2AS_PSS2AC0_LENGTH                             0x1
#define _ECCP2AS_PSS2AC0_MASK                               0x4
#define _ECCP2AS_PSS2AC1_POSN                               0x3
#define _ECCP2AS_PSS2AC1_POSITION                           0x3
#define _ECCP2AS_PSS2AC1_SIZE                               0x1
#define _ECCP2AS_PSS2AC1_LENGTH                             0x1
#define _ECCP2AS_PSS2AC1_MASK                               0x8
#define _ECCP2AS_ECCP2AS0_POSN                              0x4
#define _ECCP2AS_ECCP2AS0_POSITION                          0x4
#define _ECCP2AS_ECCP2AS0_SIZE                              0x1
#define _ECCP2AS_ECCP2AS0_LENGTH                            0x1
#define _ECCP2AS_ECCP2AS0_MASK                              0x10
#define _ECCP2AS_ECCP2AS1_POSN                              0x5
#define _ECCP2AS_ECCP2AS1_POSITION                          0x5
#define _ECCP2AS_ECCP2AS1_SIZE                              0x1
#define _ECCP2AS_ECCP2AS1_LENGTH                            0x1
#define _ECCP2AS_ECCP2AS1_MASK                              0x20
#define _ECCP2AS_ECCP2AS2_POSN                              0x6
#define _ECCP2AS_ECCP2AS2_POSITION                          0x6
#define _ECCP2AS_ECCP2AS2_SIZE                              0x1
#define _ECCP2AS_ECCP2AS2_LENGTH                            0x1
#define _ECCP2AS_ECCP2AS2_MASK                              0x40
#define _ECCP2AS_ECCP2ASE_POSN                              0x7
#define _ECCP2AS_ECCP2ASE_POSITION                          0x7
#define _ECCP2AS_ECCP2ASE_SIZE                              0x1
#define _ECCP2AS_ECCP2ASE_LENGTH                            0x1
#define _ECCP2AS_ECCP2ASE_MASK                              0x80

